print("Вы проснулись на космическом корабле, ничего не понимаете, ваши действия?")
x=input("Введите 1 чтобы связаться с Землей, 2 - чтобы осмотреть корабль ")
if(x=="1"):
  print("Земля не отвечает, помехи, никого не слышно")
  y=input("Введите 1 чтобы подать сигнал SOS или 2 чтобы нажать красную кнопку ")
  if(y=="1"):
    print("после долгого ожидания Вас услышали и за Вами направлена команда спасения")
  else:
    print("после нажатия на красную кнопку, Вы уничтожили свою планету и застрелились, поняв это")
else:
  print("на корабле никого нет, а Вы не умеете управлять кораблем")
  y=input("Введите 1, чтобы попробовать включить автопилот или 2, чтобы подать сигнал SOS ")
  if (y=="1"):
    print("после того, как Вы включили автопилот, Вы улетели в неизвестность и умерли с голоду")
  else:
    print("Ваш сигнал был услышан и за Вами направлены спасатели")


# "Вы проснулись на космическом корабле, ничего не понимаете, ваши действия?"
# "Введите 1 чтобы связаться с Землей, 2 - чтобы осмотреть корабль "
# "Земля не отвечает, помехи, никого не слышно"
# "Введите 1 чтобы подать сигнал SOS или 2 чтобы нажать красную кнопку "
# "после долгого ожидания Вас услышали и за Вами направлена команда спасения"
# "после нажатия на красную кнопку, Вы уничтожили свою планету и застрелились, поняв это"
# "на корабле никого нет, а Вы не умеете управлять кораблем"
# "Введите 1, чтобы попробовать включить автопилот или 2, чтобы подать сигнал SOS "
# "после того, как Вы включили автопилот, Вы улетели в неизвестность и умерли с голоду"
# "Ваш сигнал был услышан и за Вами направлены спасатели"